---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallLocationLineOffsetParam
source: html/303cb51b-fad3-09c4-22d7-a8b4d620dc00.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallLocationLineOffsetParam Property

"Location Line Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId WallLocationLineOffsetParam { get; }
```